import pandas as pd
import pytest


@pytest.fixture
def transactions_sample_1():
    sample_list = [
        {
            "Дата операции": "2021-12-31 16:44:00",
            "Дата платежа": "31.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -160.89,
            "Валюта операции": "RUB",
            "Сумма платежа": -160.89,
            "Валюта платежа": "RUB",
            "Кэшбэк": None,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Колхоз",
            "Бонусы (включая кэшбэк)": 3,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 160.89,
        },
        {
            "Дата операции": "2021-12-15 16:39:04",
            "Дата платежа": "15.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -118.12,
            "Валюта операции": "RUB",
            "Сумма платежа": -118.12,
            "Валюта платежа": "RUB",
            "Кэшбэк": None,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Магнит",
            "Бонусы (включая кэшбэк)": 2,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 118.12,
        },
        {
            "Дата операции": "2021-12-05 01:23:42",
            "Дата платежа": "05.12.2021",
            "Номер карты": "*5091",
            "Статус": "OK",
            "Сумма операции": -564.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -564.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": None,
            "Категория": "Различные товары",
            "MCC": 5399.0,
            "Описание": "Ozon.ru",
            "Бонусы (включая кэшбэк)": 5,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 564.0,
        },
        {
            "Дата операции": "2021-12-01 22:22:03",
            "Дата платежа": "01.12.2021",
            "Номер карты": None,
            "Статус": "OK",
            "Сумма операции": -20000.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -20000.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": None,
            "Категория": "Переводы",
            "MCC": None,
            "Описание": "Константин Л.",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 20000.0,
        },
        {
            "Дата операции": "2021-11-20 16:42:04",
            "Дата платежа": "20.11.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -64.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -64.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": None,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Колхоз",
            "Бонусы (включая кэшбэк)": 1,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 64,
        },
    ]

    return pd.DataFrame(sample_list)


@pytest.fixture
def transactions_sample_2():
    sample_list = [
        {
            "Дата операции": "2021-12-31 16:44:00",
            "Дата платежа": "31.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -160.89,
            "Валюта операции": "RUB",
            "Сумма платежа": -160.89,
            "Валюта платежа": "RUB",
            "Кэшбэк": None,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Колхоз",
            "Бонусы (включая кэшбэк)": 3,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 160.89,
        },
        {
            "Дата операции": "2021-12-15 16:39:04",
            "Дата платежа": "15.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -118.12,
            "Валюта операции": "RUB",
            "Сумма платежа": -118.12,
            "Валюта платежа": "RUB",
            "Кэшбэк": None,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Магнит",
            "Бонусы (включая кэшбэк)": 2,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 118.12,
        },
        {
            "Дата операции": "2021-12-12 18:02:00",
            "Дата платежа": "12.12.2021",
            "Номер карты": "*4556",
            "Статус": "FAILED",
            "Сумма операции": -55.00,
            "Валюта операции": "RUB",
            "Сумма платежа": -55.00,
            "Валюта платежа": "RUB",
            "Кэшбэк": None,
            "Категория": None,
            "MCC": None,
            "Описание": "Перевод на карту",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 55.00,
        },
        {
            "Дата операции": "2021-12-10 10:40:05",
            "Дата платежа": "10.12.2021",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": 20000.00,
            "Валюта операции": "RUB",
            "Сумма платежа": 20000,
            "Валюта платежа": "RUB",
            "Кэшбэк": None,
            "Категория": "Другое",
            "MCC": None,
            "Описание": "Иван С.",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 20000.00,
        },
        {
            "Дата операции": "2021-12-05 01:23:42",
            "Дата платежа": "05.12.2021",
            "Номер карты": "*5091",
            "Статус": "OK",
            "Сумма операции": -564.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -564.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": None,
            "Категория": "Различные товары",
            "MCC": 5399.0,
            "Описание": "Ozon.ru",
            "Бонусы (включая кэшбэк)": 5,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 564.0,
        },
        {
            "Дата операции": "2021-12-02 12:39:00",
            "Дата платежа": "02.12.2021",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": -1620.27,
            "Валюта операции": "RUB",
            "Сумма платежа": -1620.27,
            "Валюта платежа": "RUB",
            "Кэшбэк": 81.0,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Перекрёсток",
            "Бонусы (включая кэшбэк)": 81,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 1620.27,
        },
        {
            "Дата операции": "2021-12-01 22:22:03",
            "Дата платежа": "01.12.2021",
            "Номер карты": None,
            "Статус": "OK",
            "Сумма операции": -20000.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -20000.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": None,
            "Категория": "Переводы",
            "MCC": None,
            "Описание": "Константин Л.",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 20000.0,
        },
        {
            "Дата операции": "2021-12-01 16:42:04",
            "Дата платежа": "01.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -64.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -64.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": None,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Колхоз",
            "Бонусы (включая кэшбэк)": 1,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 64,
        },
    ]

    return pd.DataFrame(sample_list)


@pytest.fixture
def transactions_sample_3():
    sample_list = [
        {"Дата операции": "2018-02-28", "Номер карты": "*7197", "Статус": "OK", "Сумма платежа": -50.6},
        {"Дата операции": "2018-02-20", "Номер карты": "*4556", "Статус": "OK", "Сумма платежа": -1025.61},
        {"Дата операции": "2018-02-09", "Номер карты": "*7197", "Статус": "FAILED", "Сумма платежа": -5960.0},
        {"Дата операции": "2018-02-02", "Номер карты": "*7197", "Статус": "OK", "Сумма платежа": 2000.0},
        {"Дата операции": "2018-02-01", "Номер карты": "*7197", "Статус": "OK", "Сумма платежа": -325.0},
        {"Дата операции": "2018-01-31", "Номер карты": "*4556", "Статус": "OK", "Сумма платежа": -1025.61},
    ]

    return sample_list


@pytest.fixture
def transactions_sample_4():
    sample_list = [
        {"Дата операции": "2018-02-28", "Номер карты": "*7197", "Статус": "OK", "Сумма платежа": "-50.6"},
        {"Дата операции": "2018-02-20", "Номер карты": "*4556", "Статус": "OK", "Сумма платежа": -1025.61},
        {"Дата операции": "2018-02-09", "Номер карты": "*7197", "Статус": "ОК", "Сумма платежа": "abc"},
        {"Дата операции": "2018-02-02", "Номер карты": "*7197", "Статус": "OK", "Сумма платежа": None},
        {"Дата операции": "2018-02-01", "Номер карты": "*7197", "Статус": "OK", "Сумма платежа": ""},
        {"Дата операции": "2018-01-31", "Номер карты": "*4556", "Статус": "OK", "Сумма платежа": -1025.61},
    ]

    return sample_list


@pytest.fixture
def transactions_sample_5():
    sample_list = [
        {"Дата операции": "2018-02-28", "Номер карты": "*7197", "Статус": "OK", "Сумма платежа": -50.6},
        {"Дата операции": "32-13-2018", "Номер карты": "*4556", "Статус": "OK", "Сумма платежа": -1025.61},
        {"Дата операции": "2018-02-30", "Номер карты": "*7197", "Статус": "ОК", "Сумма платежа": -5960.0},
        {"Дата операции": "abc", "Номер карты": "*7197", "Статус": "OK", "Сумма платежа": -2000.0},
        {"Дата операции": "", "Номер карты": "*7197", "Статус": "OK", "Сумма платежа": -325.0},
        {"Дата операции": None, "Номер карты": "*4556", "Статус": "OK", "Сумма платежа": -1025.61},
    ]

    return sample_list


@pytest.fixture
def transactions_sample_6():
    sample_list = [
        {"Дата операции": "2018-02-28", "Номер карты": "*7197", "Статус": "OK", "Сумма платежа": "-51.6"},
        {"Дата операции": "2018-02-20", "Номер карты": "*4556", "Статус": "OK", "Сумма платежа": -1000.00},
        {"Дата операции": "2018-02-09", "Номер карты": "*7197", "Статус": "ОК", "Сумма платежа": "abc"},
        {"Дата операции": "2018-02-02", "Номер карты": "*7197", "Статус": "OK", "Сумма платежа": None},
        {"Дата операции": "2018-02-01", "Номер карты": "*7197", "Статус": "OK", "Сумма платежа": ""},
        {"Дата операции": "2018-02-01", "Номер карты": "*4556", "Статус": "OK", "Сумма платежа": {}},
    ]
    return sample_list
